In [2]:
import os
import numpy as np
import pandas as pd

In [3]:
df_titanic = pd.read_csv(r"C:\DataSets\titanic\train.csv")

In [24]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**1-Kazada ölenlerin yaş ortalamasını bulunuz**

In [5]:
died = df_titanic[df_titanic['Survived'] == 0]
average_age_died = died['Age'].mean()
print("Kazada ölenlerin yaş ortalaması: ", average_age_died)

Kazada ölenlerin yaş ortalaması:  30.62617924528302

**2-Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz**

In [7]:
average_fare_died = died['Fare'].mean() #Fare: yolcunun ödediği bilet ücreti
median_fare_died = died['Fare'].median()
print("Kazada ölenlerin bilet fiyatlarının ortalaması:", average_fare_died)
print("Kazada ölenlerin bilet fiyatlarının medyanı:", median_fare_died)

Kazada ölenlerin bilet fiyatlarının ortalaması: 22.117886885245902
Kazada ölenlerin bilet fiyatlarının medyanı: 10.5

**3-Kazada ölen erkeklerin yaş ortalamasını bulunuz**

In [11]:
died_men = died[died['Sex'] == 'male']
average_men_died = died_men['Age'].mean()
print("Kazada ölen erkeklerin yaş ortalaması:", average_men_died)

Kazada ölen erkeklerin yaş ortalaması: 31.618055555555557

**4-Kazada ölen Kadınların yaş ortalamasını bulunuz**

In [16]:
died_women = died[died['Sex'] == 'female']
average_women_died = died_women['Age'].mean()
print("Kazada ölen kadınların yaş ortalaması:", average_women_died)

Kazada ölen kadınların yaş ortalaması: 25.046875

**5-Kazadan kurtulanların yaş ortalamasını bulunuz**

In [17]:
survived = df_titanic[df_titanic['Survived'] == 1]
average_age_survived = not_died['Age'].mean()
print("Kazadan kurtulanların yaş ortalaması:", average_age_survived)

Kazadan kurtulanların yaş ortalaması: 28.343689655172415

**6-Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz**

In [18]:
average_fare_survived = not_died['Fare'].mean()
print("Kazadan kurtulanların bilet fiyatlarının ortalması:", average_fare_survived)

Kazadan kurtulanların bilet fiyatlarının ortalması: 48.39540760233918

**7-Kazadan kurtulan toplam kişi sayısını bulunuz**

In [19]:
total_survived = len(survived)
print("Kazadan kurtulan toplam kişi sayısı:", total_survived)

Kazadan kurtulan toplam kişi sayısı: 342

**8-10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz**

In [21]:
age_less_ten = df_titanic[df_titanic['Age']< 10]
age_less_ten_fare_median = age_less_ten['Fare'].median()
print("10 yaşından küçüklerin bilet fiyatlarının medyan değeri:", age_less_ten_fare_median)

10 yaşından küçüklerin bilet fiyatlarının medyan değeri: 27.0

**9-1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)**

In [25]:
for pclass in [1, 2, 3]:
    class_df = df_titanic[df_titanic['Pclass'] == pclass]
    average_fare = class_df['Fare'].mean()
    median_fare = class_df['Fare'].median()
    print(f"Pclass {pclass} - Average fare: {average_fare}, Median fare: {median_fare}")

Pclass 1 - Average fare: 84.1546875, Median fare: 60.287499999999994
Pclass 2 - Average fare: 20.662183152173913, Median fare: 14.25
Pclass 3 - Average fare: 13.675550101832993, Median fare: 8.05

**10-Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız.**

In [27]:
total_men = df_titanic[df_titanic['Sex'] == 'male']
total_women = df_titanic[df_titanic['Sex'] == 'female']

death_rate_men = len(died_men) / len(total_men)
death_rate_women = len(died_women) / len(total_women)
print("Kazada ölen kadınların oranı:", death_rate_women)
print("Kazada ölen erkeklerin oranı:", death_rate_men)

Kazada ölen kadınların oranı: 0.25796178343949044
Kazada ölen erkeklerin oranı: 0.8110918544194108